app/controllers/reports_controller.rb

SELECT "reports".* FROM "reports"
---
  def index
  	@reports = Report.all

SELECT  "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
  	@report = Report.find(params[:id])